{"name":"Swaraj Endait","email":"endaitswaraj@gmail.com","summary":":\n12+ years in QA automation in various domains. Exploring a Senior Technical role.","skills":":\nAutomation: Selenium, Selenium Grid, Cucumber, Jenkins, Robot, AutoIT, SilkTest, JMeter\nProgramming: Python, Perl, Java","certification":"s: Certified Scrum Master, ISTQB: Certified Scrum Master, ISTQB","experience":":\nSep 2015 QA Manager, Company1, City1, India.\nTill Date - Responsible for managing a QA team: planning, execution of releases. Team size: 4.\n- UI automation and REST API automation using Selenium and Cucumber.\n- Implemented Continuous Integration using Jenkins and headless browser.\n- Python and shell scripting to automate QA tasks.\nMay2013 Team Lead, Company2, City2, India.\nAug 2015 - QA lead. Team size: 12\n- Held the responsibility of planning and execution of releases in addition to automation.\n- REST API and UI automation using Robot Framework (Selenium).\n- Python scripting to automate QA of scripts which dealt with a huge data repository.\nDec 2006 Senior Member of Technical Staff, Company3, City1, India.\nApr 2009 - QA lead. Team size: 4.\n- Planning test cycles on various platforms via Virtual machines (VM Images on ESX server).\n- Designed a framework for the automation of the testcases using AutoIT.\nAug 2004 System Engineer, Company4 , City1, India.\nSep 2006 - Initiated and led the automation effort for the product using SilkTest.Team size: 4.\n- Perl scripting for a Report generator,which consolidated and publishing test results.\n- Also led the activity of Man ual QA of a client server and web application.\nNov 2002 QA Engineer, Company5, City1, India.\nJul 2004 - Testing of a banking call center application. Team size: 3.\n- Perl scripting fora report generator and post testing analys is module.\n- Took up the responsibility as a developer along with testing for a period of six months.\nJul 2000 QA Engineer, Company6, City2, India.\nOct 2002 - Testing Banking, HealthCare applications. Automation using Rational Robot, SilkTest.","education":":\n1999 -00 Diploma in Advanced Computing, Edu1, City1, India, Distinction.\n1994 -99 BE (Mech Eng), Edu2 College of Eng, City1, India, First Class."}